{
  "basics": {
    "name": "Sweta Pati",
    "label": "Master's Student in Computer Science",
    "email": "spati@gmu.edu",
    "phone": "+1-571-567-0267",
    "url": "https://github.com/swetapati22",
    "summary": "A dedicated Master's student in Computer Science specializing in Machine Learning with extensive research and professional experience in Data Science, Machine Learning and Natural Language Processing.",
    "location": {
      "address": "9411 Lee Hwy",
      "postalCode": "22030",
      "city": "Fairfax",
      "countryCode": "US",
      "region": "Virginia"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "sweta-pati",
        "url": "https://www.linkedin.com/in/sweta-pati/"
      },
      {
        "network": "GitHub",
        "username": "swetapati22",
        "url": "https://github.com/swetapati22"
      }
    ]
  },
  "education": [
    {
      "institution": "George Mason University",
      "location": "Fairfax, VA",
      "url": "https://gmu.edu",
      "studyType": "Master's in Compuer Science with Specialization in Machine Learning",
      "startDate": "August, 2023",
      "endDate": "May, 2025",
      "score": "3.93"
    },
    {
      "institution": "Kalinga Institute of Industrial Technology",
      "location": "Odisha, India",
      "studyType": "Bachelor's in Computer Science and Engineering",
      "startDate": "May, 2016",
      "endDate": "May, 2025",
      "score": "3.60"
    }
  ],
  "research": [
    {
      "name": "Event Extraction",
      "advisor": "Prof. Ziyu Yao",
      "year": "2024",
      "status": "Ongoing",
      "summary": "Enhancing Event Extraction using instruction-tuned LLMs to achieve superior performance on unseen domains.",
      "highlights": [
        "Synthesized comprehensive guidelines for 13 datasets involving 500+ events and 4000+ arguments, achieving an 8% absolute increase in F1-score through LLaMA-3.1 8B with LoRA and several regularization techniques.",
        "Engineered preprocessing steps to transform unstructured natural language text into structured code prompts across 13 datasets, enhancing evaluation and reducing hallucination by leveraging implicit prompt optimization.",
        "Constructed an ontology for events and arguments in code prompts applicable to 3 different EE tasks across 8 domains.",
        "Fine-tuned and evaluated the LLaMA-3.1 8B model for EAE, ED, and E2E tasks using a custom-designed evaluation script."
      ]
    },
    {
      "name": "Prompt Optimization",
      "advisor": "Prof. Ziyu Yao",
      "year": "2024",
      "status": "Ongoing",
      "summary": "Exploring advanced prompt optimization techniques in Event Extraction.",
      "highlights": [
        "Compared different prompt engineering techniques such as zero-shot, few-shot, CoT, and prompt optimization.",
        "Explored Monte Carlo Tree Search-based and fine-tuning approaches to prompt optimization on 3 datasets.",
        "Aiming to deliver clearer, more actionable inputs that improve the overall functionality and reliability of LLMs in identifying and classifying events."
      ]
    }
  ],
  "projects": [
    {
      "name": "Dynamic Bus Routing System",
      "achievement": "Winner at Smart India Hackathon",
      "summary": "Developed an algorithmic solution to alleviate congestion on specific routes through dynamic allocation of buses.",
      "highlights": [
        "Designed a system that dynamically allocates buses based on capacity (via ticketing system) and demand within each route.",
        "Implemented YOLO object detection to calculate demand at each bus stop and inside buses."
      ]
    }
  ],
  "work": [
    {
      "name": "George Mason University",
      "position": "Research Assistant",
      "url": "https://gmu.edu",
      "startDate": "2024-08",
      "endDate": "Present",
      "summary": "Researching NLP topics such as Event Extraction and Prompt Engineering under the guidance of Prof. Ziyu Yao."
    },
    {
      "name": "George Mason University",
      "position": "Summer Research Internship",
      "url": "https://gmu.edu",
      "startDate": "2024-06",
      "endDate": "2024-08",
      "summary": "Working with Prof. Ziyu Yao in the domain of Information Extraction, more briefly explored generalization in Event Extraction through instruction-tuned LLMs."
    },
    {
      "name": "Highradius Technologies Private Limited",
      "position": "Data Scientist",
      "startDate": "2020-09",
      "endDate": "2023-08",
      "location": "Odisha, India",
      "summary": "Implemented and deployed machine learning models for Fortune 500 companies, enhancing operational efficiency and predictive accuracy.",
      "highlights": [
        "Implemented an end-to-end imbalance classification ML model - Deduction Validity Predictor (DVP) for 25 Fortune 500 clients like Nestle, Kraft Heinz, and Clorox, achieving 85% average accuracy and increasing recovery rate by 12% in US dollars.",
        "Conceptualized and productionized an ML regression model pipeline for Payment Date Prediction (PDP) for 20 Fortune 500 clients like Uber, AstraZeneca, and Kellogs, successfully reducing their Days Sales Outstanding (DSO) by 30%.",
        "Reduced DVP implementation timeline by 48% and PDP by 57% through automation of ML and deployment pipelines.",
        "Developed a digital assistant, Freeda, used by Fortune 500 companies to understand intent behind user queries and provide appropriate responses for multiple Highradius cloud products.",
        "Mentored over 15 interns in critical data science and business concepts during the 2021 and 2022 internship programs."
      ]
    },
    {
      "name": "Indian Institute of Technology, Kharagpur",
      "position": "Research Intern",
      "startDate": "2018-06",
      "endDate": "2018-06",
      "location": "West Bengal, India",
      "summary": "Developed BCH error correction codes and tested OpenSSL authentication protocols.",
      "highlights": [
        "Implemented BCH error correction code and compared existing test suites in OpenSSL with the proposed authentication protocol.",
        "Published a research paper titled 'An OpenSSL Extension for PUF-based Authentication' in IEEE DSP 2018."
      ]
    }
  ],
  "awards": [
    {
      "title": "Best Performer of the Team",
      "date": "2020-2021",
      "awarder": "Highradius Technologies",
      "summary": "Awarded for exceptional contributions across three quarters."
    },
    {
      "title": "Winner, Smart India Hackathon: National Level Hackathon by Govt. of INDIA",
      "date": "2019-03",
      "awarder": "Government of INDIA",
      "summary": "Recognized for developing an algorithmic solution to alleviate congestion on throughout all routes within a city through dynamic allocation of buses."
    }
  ],
  "skills": [
    {
      "name": "Programming Languages",
      "keywords": ["Python", "Java", "SQL"]
    },
    {
      "name": "Machine Learning & Data Science",
      "keywords": [
        "Statistics",
        "Classification",
        "Regression",
        "Ensemble Methods (Bagging, Boosting)",
        "Clustering",
        "Time Series",
        "Scikit-learn",
        "PySpark",
        "Hugging Face Transformers",
        "YOLO",
        "ML Ops",
        "Neural Networks",
        "CUDA",
        "HPC",
        "NLP",
        "LLM",
        "Fine Tuning",
        "LangChain",
        "Generative AI"
      ]
    },
    {
      "name": "Tools & Frameworks",
      "keywords": ["Pytorch", "Dialogflow", "GIT", "GitHub", "Jira", "Docker", "AWS Cloud"]
    },
    {
      "name": "General Skills",
      "keywords": [
        "Data Visualization",
        "Predictive Modeling",
        "Data Mining",
        "Data Analysis"
      ]
    }
  ],
  "certificates": [
    {
      "title": "Oracle Cloud Infrastructure 2024 Generative AI Certified Professional",
      "date": "2024-08",
      "awarder": "Oracle",
      "summary": "Certification in Generative AI demonstrating expertise in Oracle's Cloud Infrastructure."
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent"
    },
    {
      "language": "Hindi",
      "fluency": "Fluent"
    },
    {
      "language": "Odia",
      "fluency": "Native Speaker"
    }
  ]
}
